Core/src/InformationRegisters/LT_СоответствияУслуг99/LT_СоответствияУслуг99.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>LT_СоответствияУслуг99</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <dimensions>
    <name>DescriptionOfInstruction</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/LT_ГруппаЗапасов/LT_ГруппаЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>LT_ГруппаЗапасов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <dimensions>
    <name>DescriptionOfInstruction</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/LT_КатегорияУслуги/LT_КатегорияУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>LT_КатегорияУслуги</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </resources>
</mdclass:InformationRegister>

Core/src/InformationRegisters/LT_КатегорииЗапасов/LT_КатегорииЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>LT_КатегорииЗапасов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </resources>
  <dimensions>
    <name>InventoryPostingGroup</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>MakeCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>UnitOfMeasure</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/LT_НаправленияДеятельностиУслуг/LT_НаправленияДеятельностиУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>LT_НаправленияДеятельностиУслуг</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </resources>
  <dimensions>
    <name>DescriptionOfInstruction</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/LT_НаправленияДеятельностиЗапасов/LT_НаправленияДеятельностиЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>LT_НаправленияДеятельностиЗапасов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </resources>
  <dimensions>
    <name>КатегорияНоменклатуры</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/LT_СоответствияБанковскихСчетовКассы/LT_СоответствияБанковскихСчетовКассы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>LT_СоответствияБанковскихСчетовКассы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>БанковскийСчетКасса</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Кассы</types>
    </type>
  </resources>
  <dimensions>
    <name>POS</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/ВидыКонтрагентов/ВидыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКонтрагентов</name>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныйПредприниматель</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ГосударственныйОрган</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Запас</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Операция</name>
  </enumValues>
  <enumValues>
    <name>ВидРабот</name>
  </enumValues>
</mdclass:Enum>

Core/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерхняяГраницаОстатков</name>
    <comment>Используется в прайс-листе при выводе остатков в виде представления</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.ВидыАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМаркировки</name>
    <type>
      <types>EnumRef.ВидыМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыписыватьГарантийныйТалон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГарантийныйСрок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортнаяАлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключитьИзПрайсЛистов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПартии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерийныеНомера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатуры</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМВид</name>
    <type>
      <types>EnumRef.ВидыКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМРазмер</name>
    <type>
      <types>EnumRef.РазмерыКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМСпособВыпускаВОборот</name>
    <type>
      <types>EnumRef.СпособыВыпускаВОборотГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Крепость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодОценки</name>
    <type>
      <types>EnumRef.МетодОценкиЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НижняяГраницаОстатков</name>
    <comment>Используется в прайс-листе при выводе остатков в виде представления</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДАЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводительИмпортерАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>РекомендуемЗаказать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПополнения</name>
    <type>
      <types>EnumRef.СпособыПополненияЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействияФлагаНовинка</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполненияЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПополнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗапасов</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭДГИСМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированнаяСтоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <type>
      <types>CatalogRef.ЦеновыеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоНовинка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяНоменклатураВЭД</name>
    <type>
      <types>CatalogRef.КлассификаторТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <comment>Вес брутто (кг) (Gross Weight)</comment>
    <type>
      <types>DefinedType.Вес</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>DefinedType.Объем</types>
    </type>
  </attributes>
  <attributes>
    <name>Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗапасовРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗатратРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Неактивен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаПереработчикуРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентИмпорта</name>
    <type>
      <types>CatalogRef.ПроцентыИмпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесНетто</name>
    <comment>Вес брутто (кг) (Gross Weight)</comment>
    <type>
      <types>DefinedType.Вес</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/CommonModules/LT_КонвертацияXML_Фаилов_DMS/Module.bsl
Процедура ПеренестиТаблицыDMS() Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("LT_ИспользоватьВыгрузкуДанныхИзDMS") Тогда
		Возврат;
	КонецЕсли;
	
	СчетаРегл		= РегламентированныйУчетСервер.ПолучитьСчетаКонтрагентаПоУмолчанию();
	LT_СчетУчетаРасчетовСПоставщикомРеглДляDMS = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("LT_СчетУчетаРасчетовСПоставщикомРеглДляDMS");
	Если ЗначениеЗаполнено(LT_СчетУчетаРасчетовСПоставщикомРеглДляDMS) Тогда
		СчетаРегл.Вставить("СчетУчетаРасчетовСПоставщикомРегл", LT_СчетУчетаРасчетовСПоставщикомРеглДляDMS);
	КонецЕсли;
	ТекущаяДата = ТекущаяДата();
	
	СчетаЗатратНоменклатуры = Новый Структура;
	СчетаЗатратНоменклатуры.Вставить("СчетУчетаЗатрат", 	ПредопределенноеЗначение("ПланСчетов.Управленческий.НезавершенноеПроизводство"));
	СчетаЗатратНоменклатуры.Вставить("СчетУчетаЗатратРегл", РегламентированныйУчетСервер.ПолучитьСчетПоНомеру("1630"));
	
	КоличествоЗнаковПослеЗапятойВЦене = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("КоличествоЗнаковПослеЗапятойВЦене");

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Р_Д_Ч", 					Сред(Строка(1/2), 2, 1));
	СтруктураПараметров.Вставить("Штука", 					УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСправочника("КлассификаторЕдиницИзмерения", "шт"));
	СтруктураПараметров.Вставить("СчетаЗатратНоменклатуры", СчетаЗатратНоменклатуры);
	СтруктураПараметров.Вставить("СчетаРегл", 				СчетаРегл);
	СтруктураПараметров.Вставить("НДС0",					УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("НДС0"));
	СтруктураПараметров.Вставить("НДС18",					УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("НДС18"));
	СтруктураПараметров.Вставить("ЮридическоеЛицо",			Перечисления.ВидыКонтрагентов.ЮридическоеЛицо);
	СтруктураПараметров.Вставить("ФизическоеЛицо",			Перечисления.ВидыКонтрагентов.ФизическоеЛицо);
	СтруктураПараметров.Вставить("Запас",					Перечисления.ТипыНоменклатуры.Запас);
	СтруктураПараметров.Вставить("Услуга",					Перечисления.ТипыНоменклатуры.Услуга);
	СтруктураПараметров.Вставить("БезКатегории",			УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСправочника("КатегорииНоменклатуры", 	"БезКатегории"));
	СтруктураПараметров.Вставить("ОсновноеНаправление",		УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСправочника("НаправленияДеятельности", "ОсновноеНаправление"));
	СтруктураПараметров.Вставить("ТочностьЦены",			?(КоличествоЗнаковПослеЗапятойВЦене = 0, 2, КоличествоЗнаковПослеЗапятойВЦене));
	СтруктураПараметров.Вставить("ТекущаяДата",			 	ТекущаяДата);
	СтруктураПараметров.Вставить("ТекущаяДатаСтрокой",		Формат(Год(ТекущаяДата), "ЧГ=0") + Формат(Месяц(ТекущаяДата), "ЧЦ=2; ЧВН=; ЧГ=0") + Формат(День(ТекущаяДата), "ЧЦ=2; ЧВН=; ЧГ=0"));
	СтруктураПараметров.Вставить("АдресXMLФаиловНаДиске",	УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("LT_АдресXMLФаиловНаДиске"));
	
	
	//ნაწილების შესყიდვა
	Попытка
		Parts_Purch_Invoices(СтруктураПараметров);
	Исключение
	КонецПопытки;
	//ნაწილების გაყიდვა მუშაა
	Попытка
		Parts_Sales_Invoices(СтруктураПараметров);
	Исключение
	КонецПопытки;
	Попытка
		Service_Sales_Invoices(СтруктураПараметров);
	Исключение
	КонецПопытки;
	//თანხის შემოსვლა
	Попытка
		Cash_Customer(СтруктураПараметров);
	Исключение
	КонецПопытки;
	
КонецПроцедуры


//შესყიდვა
Процедура Parts_Purch_Invoices(СтруктураПараметров)
	
	Р_Д_Ч			= СтруктураПараметров.Р_Д_Ч;
	НДС0			= СтруктураПараметров.НДС0;
	НДС18			= СтруктураПараметров.НДС18;
	ТекущаяДата 	= СтруктураПараметров.ТекущаяДата;
	ТекущаяДатаСтрокой = СтруктураПараметров.ТекущаяДатаСтрокой;
	ТочностьЦены    = СтруктураПараметров.ТочностьЦены;

	ПолныйПутьКФаилу = "";
	НйденныеФаилы = НайтиФайлы(СтруктураПараметров.АдресXMLФаиловНаДиске, "*xml");
	Для Каждого ТекФаил ИЗ НйденныеФаилы Цикл
		Если НЕ Найти(ТекФаил.ИмяБезРасширения, ТекущаяДатаСтрокой) = 0 И//დღევანდელი თარიღი
			 НЕ Найти(ТекФаил.ИмяБезРасширения, "Parts_Purch_Invoices") = 0 Тогда
			ПолныйПутьКФаилу = ТекФаил.ПолноеИмя;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если НЕ ЗначениеЗаполнено(ПолныйПутьКФаилу) Тогда
		Возврат;
	КонецЕсли;
	
	Чтение = Новый ЧтениеXML;
	Чтение.ОткрытьФайл(ПолныйПутьКФаилу);
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(Чтение);
	
	Vendors = ОбъектXDTO.Directories.Vendor;
	//Items	= ОбъектXDTO.Directories.Item;
	
	Если ТипЗнч(ОбъектXDTO.Documents.PurchInvoice) = Тип("ОбъектXDTO") Тогда
		Invoices = Новый Массив;
		Invoices.Добавить(ОбъектXDTO.Documents.PurchInvoice);
	Иначе
		Invoices = ОбъектXDTO.Documents.PurchInvoice;
	КонецЕсли;
	
	Для Каждого Invoice Из Invoices Цикл
		Если Invoice.Pay_toVendorNo = "VD-0006" ИЛИ Invoice.Pay_toVendorNo = "VD-0023" ИЛИ Лев(Invoice.No,3) = "POP"  Тогда
			Продолжить;
		КонецЕсли;
		Ссылка = Документы.ПриходнаяНакладная.НайтиПоРеквизиту("TL_DMSNo", Invoice.No);//PPIP00001
		Если ЗначениеЗаполнено(Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		Дата = РС_ОбщегоНазначения.ПереводВДату(Invoice.PostingDate);
		Если НачалоДня(Дата) <> НачалоДня(ТекущаяДата()) Тогда
			Продолжить;
		КонецЕсли;	
		
		НовДокумент = Документы.ПриходнаяНакладная.СоздатьДокумент();
		НовДокумент.Заполнить(Неопределено);
		НовДокумент.Дата  		= Дата;//2018-10-16T17:19:06
		НовДокумент.TL_DMSNo 	= Invoice.No;

		НовДокумент.Контрагент	= ПолучитьКонтрагент(Invoice, Vendors, СтруктураПараметров, "Purch");
		НовДокумент.Договор		= НовДокумент.Контрагент.ДоговорПоУмолчанию;
		НовДокумент.Комментарий = "დაგენერირდა DMS-დან " + ТекущаяДата;

		Если ТипЗнч(Invoice.Line) = Тип("ОбъектXDTO") Тогда
			Lines = Новый Массив;
			Lines.Добавить(Invoice.Line);
		Иначе
			Lines = Invoice.Line;
		КонецЕсли;
		//Таб Часть запасы_
		Для Каждого СтрокаLine ИЗ Lines Цикл
			AmountIVСтрокой 		= СтрЗаменить(СтрокаLine.AmountIncludingVAT, ",", "");
			AmountСтрокой 			= СтрЗаменить(СтрокаLine.Amount, 			 ",", "");
			QuantityСтрокой 		= СтрЗаменить(СтрокаLine.Quantity, 			 ",", "");
			ПроцентСкидкиСтрокой 	= СтрЗаменить(СтрокаLine.LineDiscount, 		 ",", "");
			ПроцентСкидки			= Число(СтрЗаменить(ПроцентСкидкиСтрокой, ".", Р_Д_Ч));
			
			НовСтрока = ?(СтрокаLine.Type = "Item", НовДокумент.Запасы.Добавить(), НовДокумент.Расходы.Добавить());
			НовСтрока.Номенклатура 			= ПолучитьНоменклатуру(СтрокаLine, СтруктураПараметров, ОбъектXDTO.Directories.Item);
			НовСтрока.ЕдиницаИзмерения 		= НовСтрока.Номенклатура.ЕдиницаИзмерения;
			НовСтрока.Сумма					= Число(СтрЗаменить(AmountIVСтрокой, ".", Р_Д_Ч));
			НовСтрока.Всего					= НовСтрока.Сумма;
			НовСтрока.Количество			= Число(СтрЗаменить(QuantityСтрокой, ".", Р_Д_Ч));
			НовСтрока.ПроцентСкидкиНаценки	= ПроцентСкидки;
			Если ПроцентСкидки = 0 Тогда
				НовСтрока.Цена				= ?(НовСтрока.Количество = 0 , 0, Окр(НовСтрока.Сумма/НовСтрока.Количество, ТочностьЦены));
			Иначе
				НовСтрока.Цена				= ?(НовСтрока.Количество = 0 , 0, Окр(НовСтрока.Сумма/(1-ПроцентСкидки/100)/НовСтрока.Количество, ТочностьЦены));
			КонецЕсли;
			НовСтрока.СтавкаНДС				= ?(СтрокаLine.VAT = "18", НДС18, НДС0);
			НовСтрока.СуммаНДС				= НовСтрока.Всего - Число(СтрЗаменить(AmountСтрокой, ".", Р_Д_Ч));
			//Прервать;
		КонецЦикла;
		//_Таб часть запасы
		//Прервать;
		
		Попытка
			НовДокумент.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			НовДокумент.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
		
		//Прервать;
		
	КонецЦикла;

	Чтение.Закрыть();
	
КонецПроцедуры

//გაყიდვა
Процедура Parts_Sales_Invoices(СтруктураПараметров)
	
	Р_Д_Ч			= СтруктураПараметров.Р_Д_Ч;
	НДС0			= СтруктураПараметров.НДС0;
	НДС18			= СтруктураПараметров.НДС18;
	ТекущаяДата 	= СтруктураПараметров.ТекущаяДата;
	ТекущаяДатаСтрокой = СтруктураПараметров.ТекущаяДатаСтрокой;
	ТочностьЦены    = СтруктураПараметров.ТочностьЦены;

	ПолныйПутьКФаилу = "";
	НйденныеФаилы = НайтиФайлы(СтруктураПараметров.АдресXMLФаиловНаДиске, "*xml");
	Для Каждого ТекФаил ИЗ НйденныеФаилы Цикл
		Если НЕ Найти(ТекФаил.ИмяБезРасширения, ТекущаяДатаСтрокой) = 0 И//დღევანდელი თარიღი
			 НЕ Найти(ТекФаил.ИмяБезРасширения, "Parts_Sales_Invoices") = 0 Тогда
			ПолныйПутьКФаилу = ТекФаил.ПолноеИмя;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если НЕ ЗначениеЗаполнено(ПолныйПутьКФаилу) Тогда
		Возврат;
	КонецЕсли;
	
	Чтение = Новый ЧтениеXML;
	Чтение.ОткрытьФайл(ПолныйПутьКФаилу);
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(Чтение);

	
	Vendors = ОбъектXDTO.Directories.Customer;
	
	Если ТипЗнч(ОбъектXDTO.Documents.SalesInvoice) = Тип("ОбъектXDTO") Тогда
		Invoices = Новый Массив;
		Invoices.Добавить(ОбъектXDTO.Documents.SalesInvoice);
	Иначе
		Invoices = ОбъектXDTO.Documents.SalesInvoice;
	КонецЕсли;

	Для Каждого Invoice Из Invoices Цикл
		Если (Лев(Invoice.Bill_toCustomerNo,8) = "INTERNAL") ИЛИ Лев(Invoice.No,3) = "POP" Тогда
			Продолжить;
		КонецЕсли;
		
		Дата = РС_ОбщегоНазначения.ПереводВДату(Invoice.PostingDate);
		Если НачалоДня(Дата) <> НачалоДня(ТекущаяДата()) Тогда
			Продолжить;
		КонецЕсли;                                                         
		
		//Ссылка = Документы.РасходнаяНакладная.НайтиПоРеквизиту("TL_DMSNo",Invoice.No); //Lazare
		//Если ЗначениеЗаполнено(Ссылка) Тогда
		//	Продолжить;
		//КонецЕсли;
		Значение_ЭтоПодарок = ?(Invoice.Bill_toCustomerNo = "INTERNAL2", Истина, Ложь);
		
		
		НовДокумент = Документы.РасходнаяНакладная.СоздатьДокумент();
		НовДокумент.Заполнить(Неопределено);
		НовДокумент.Дата  		= РС_ОбщегоНазначения.ПереводВДату(Invoice.PostingDate);//2018-10-16T17:19:06
		НовДокумент.TL_DMSNo 	= Invoice.No;
		

		НовДокумент.Контрагент	= ПолучитьКонтрагент(Invoice, Vendors, СтруктураПараметров, "Sale");
		НовДокумент.Договор		= НовДокумент.Контрагент.ДоговорПоУмолчанию;
		
		НовДокумент.Комментарий = Invoice.OrderNo;
		//НовДокумент.Комментарий = "დაგენერირდა DMS-დან " + ТекущаяДата;

		//Таб Часть запасы_
		Если ТипЗнч(Invoice.Line) = Тип("ОбъектXDTO") Тогда
			Lines = Новый Массив;
			Lines.Добавить(Invoice.Line);
		Иначе
			Lines = Invoice.Line;
		КонецЕсли;
		Для Каждого СтрокаLine ИЗ Lines Цикл
			AmountIVСтрокой 		= СтрЗаменить(СтрокаLine.AmountIncludingVAT, ",", "");
			AmountСтрокой 			= СтрЗаменить(СтрокаLine.Amount, 			 ",", "");
			QuantityСтрокой 		= СтрЗаменить(СтрокаLine.Quantity, 			 ",", "");
			ПроцентСкидкиСтрокой 	= СтрЗаменить(СтрокаLine.LineDiscount, 		 ",", "");
			ПроцентСкидки			= Число(СтрЗаменить(ПроцентСкидкиСтрокой, ".", Р_Д_Ч));
			
			НовСтрока = НовДокумент.Запасы.Добавить();
			НовСтрока.ЭтоПодарок			= Значение_ЭтоПодарок;
			НовСтрока.Номенклатура 			= ПолучитьНоменклатуру(СтрокаLine, СтруктураПараметров, ОбъектXDTO.Directories.Item);
			НовСтрока.ЕдиницаИзмерения 		= НовСтрока.Номенклатура.ЕдиницаИзмерения;
			НовСтрока.Сумма					= Число(СтрЗаменить(AmountIVСтрокой, ".", Р_Д_Ч));
			НовСтрока.Всего					= НовСтрока.Сумма;
			НовСтрока.Количество			= Число(СтрЗаменить(QuantityСтрокой, ".", Р_Д_Ч));
			НовСтрока.ПроцентСкидкиНаценки	= ПроцентСкидки;
			Если ПроцентСкидки = 0 Тогда
				НовСтрока.Цена				= ?(НовСтрока.Количество = 0 , 0, Окр(НовСтрока.Сумма/НовСтрока.Количество, ТочностьЦены));
			Иначе
				НовСтрока.Цена				= ?(НовСтрока.Количество = 0 , 0, Окр(НовСтрока.Сумма/(1-ПроцентСкидки/100)/НовСтрока.Количество, ТочностьЦены));
			КонецЕсли;
			НовСтрока.СтавкаНДС				= ?(СтрокаLine.VAT = "18", НДС18, НДС0);
			НовСтрока.СуммаНДС				= НовСтрока.Всего - Число(СтрЗаменить(AmountСтрокой, ".", Р_Д_Ч));
			//Прервать;
		КонецЦикла;
		//_Таб часть запасы
		//Прервать;
		
		Попытка
			НовДокумент.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			НовДокумент.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
		
		//Прервать;
		
	КонецЦикла;

	//Чтение.Закрыть();
КонецПроцедуры

Процедура Service_Sales_Invoices(СтруктураПараметров)
	
	Р_Д_Ч			= СтруктураПараметров.Р_Д_Ч;
	НДС0			= СтруктураПараметров.НДС0;
	НДС18			= СтруктураПараметров.НДС18;
	ТекущаяДата 	= СтруктураПараметров.ТекущаяДата;
	ТекущаяДатаСтрокой = СтруктураПараметров.ТекущаяДатаСтрокой;
	ТочностьЦены    = СтруктураПараметров.ТочностьЦены;
	
	ПолныйПутьКФаилу = "";
	НйденныеФаилы = НайтиФайлы(СтруктураПараметров.АдресXMLФаиловНаДиске, "*xml");
	Для Каждого ТекФаил ИЗ НйденныеФаилы Цикл
		Если НЕ Найти(ТекФаил.ИмяБезРасширения, ТекущаяДатаСтрокой) = 0 И//დღევანდელი თარიღი
			 НЕ Найти(ТекФаил.ИмяБезРасширения, "Service_Sales_Invoices") = 0 Тогда
			ПолныйПутьКФаилу = ТекФаил.ПолноеИмя;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если НЕ ЗначениеЗаполнено(ПолныйПутьКФаилу) Тогда
		Возврат;
	КонецЕсли;
	
	Чтение = Новый ЧтениеXML;
	Чтение.ОткрытьФайл(ПолныйПутьКФаилу);
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(Чтение);
	
	Vendors = ОбъектXDTO.Directories.Customer;
	
	Если ТипЗнч(ОбъектXDTO.Documents.SalesInvoice) = Тип("ОбъектXDTO") Тогда
		Invoices = Новый Массив;
		Invoices.Добавить(ОбъектXDTO.Documents.SalesInvoice);
	Иначе
		Invoices = ОбъектXDTO.Documents.SalesInvoice;
	КонецЕсли;

	Для Каждого Invoice Из Invoices Цикл
		Если (Лев(Invoice.Bill_toCustomerNo,8) = "INTERNAL") ИЛИ Лев(Invoice.No,3) = "POP" Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(Invoice.Line) = Тип("ОбъектXDTO") Тогда
			Lines = Новый Массив;
			Lines.Добавить(Invoice.Line);
		Иначе
			Lines = Invoice.Line;
		КонецЕсли;
		
		НомерDMS = "";
		
		Для Каждого СтрокаLine ИЗ Lines Цикл
			НомерDMS = СтрокаLine.ServiceOrderNo;
			Прервать;
		КонецЦикла;
		
		//Ссылка = Документы.РасходнаяНакладная.НайтиПоРеквизиту("TL_DMSNo", Invoice.No);
		//Если ЗначениеЗаполнено(Ссылка) Тогда
		//	Продолжить;
		//КонецЕсли;
		
		Дата = РС_ОбщегоНазначения.ПереводВДату(Invoice.PostingDate);
		Если НачалоДня(Дата) <> НачалоДня(ТекущаяДата()) Тогда
			Продолжить;
		КонецЕсли;
		
		Значение_ЭтоПодарок = ?(Invoice.Bill_toCustomerNo = "INTERNAL2", Истина, Ложь);
		
		НовДокумент = Документы.РасходнаяНакладная.СоздатьДокумент();
		НовДокумент.Заполнить(Неопределено);
		НовДокумент.Дата  		= РС_ОбщегоНазначения.ПереводВДату(Invoice.PostingDate);//2018-10-16T17:19:06
		НовДокумент.TL_DMSNo 	= Invoice.No;
		

		НовДокумент.Контрагент	= ПолучитьКонтрагент(Invoice, Vendors, СтруктураПараметров, "Sale");
		НовДокумент.Договор		= НовДокумент.Контрагент.ДоговорПоУмолчанию;
		
		//НовДокумент.Комментарий = "დაგენერირდა DMS-დან " + ТекущаяДата;
        НовДокумент.Комментарий = НомерDMS;
		//Таб Часть запасы_
		
		Для Каждого СтрокаLine ИЗ Lines Цикл
			AmountIVСтрокой 		= СтрЗаменить(СтрокаLine.AmountIncludingVAT, ",", "");
			AmountСтрокой 			= СтрЗаменить(СтрокаLine.Amount, 			 ",", "");
			QuantityСтрокой 		= СтрЗаменить(СтрокаLine.Quantity, 			 ",", "");
			ПроцентСкидкиСтрокой 	= СтрЗаменить(СтрокаLine.LineDiscount, 		 ",", "");
			ПроцентСкидки			= Число(СтрЗаменить(ПроцентСкидкиСтрокой, ".", Р_Д_Ч));
			
			НовСтрока = НовДокумент.Запасы.Добавить();
			НовСтрока.ЭтоПодарок			= Значение_ЭтоПодарок;
			НовСтрока.Номенклатура 			= ПолучитьНоменклатуру(СтрокаLine, СтруктураПараметров, ОбъектXDTO.Directories.Item);
			НовСтрока.ЕдиницаИзмерения 		= НовСтрока.Номенклатура.ЕдиницаИзмерения;
			НовСтрока.Сумма					= Число(СтрЗаменить(AmountIVСтрокой, ".", Р_Д_Ч));
			НовСтрока.Всего					= НовСтрока.Сумма;
			НовСтрока.Количество			= Число(СтрЗаменить(QuantityСтрокой, ".", Р_Д_Ч));
			НовСтрока.ПроцентСкидкиНаценки	= ПроцентСкидки;
			Если ПроцентСкидки = 0 Тогда
				НовСтрока.Цена				= ?(НовСтрока.Количество = 0 , 0, Окр(НовСтрока.Сумма/НовСтрока.Количество, ТочностьЦены));
			Иначе
				НовСтрока.Цена				= ?(НовСтрока.Количество = 0 , 0, Окр(НовСтрока.Сумма/(1-ПроцентСкидки/100)/НовСтрока.Количество, ТочностьЦены));
			КонецЕсли;
			НовСтрока.СтавкаНДС				= ?(СтрокаLine.VAT = "18", НДС18, НДС0);
			НовСтрока.СуммаНДС				= НовСтрока.Всего - Число(СтрЗаменить(AmountСтрокой, ".", Р_Д_Ч));
			//Прервать;
		КонецЦикла;
		//_Таб часть запасы
		//Прервать;
		
		Попытка
			НовДокумент.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			НовДокумент.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
		
		//Прервать;
		
	КонецЦикла;

	//Чтение.Закрыть();
КонецПроцедуры

//თანხის მიღება
Процедура Cash_Customer(СтруктураПараметров)
	
	Р_Д_Ч			= СтруктураПараметров.Р_Д_Ч;
	НДС0			= СтруктураПараметров.НДС0;
	НДС18			= СтруктураПараметров.НДС18;
	ТекущаяДата 	= СтруктураПараметров.ТекущаяДата;
	ТекущаяДатаСтрокой = СтруктураПараметров.ТекущаяДатаСтрокой;
	ТочностьЦены    = СтруктураПараметров.ТочностьЦены;
	
	ПолныйПутьКФаилу = "";
	НйденныеФаилы = НайтиФайлы(СтруктураПараметров.АдресXMLФаиловНаДиске, "*xml");
	Для Каждого ТекФаил ИЗ НйденныеФаилы Цикл
		Если НЕ Найти(ТекФаил.ИмяБезРасширения, ТекущаяДатаСтрокой) = 0 И//დღევანდელი თარიღი
			 НЕ Найти(ТекФаил.ИмяБезРасширения, "Cash_Customer") = 0 Тогда
			ПолныйПутьКФаилу = ТекФаил.ПолноеИмя;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если НЕ ЗначениеЗаполнено(ПолныйПутьКФаилу) Тогда
		Возврат;
	КонецЕсли;
	
	Чтение = Новый ЧтениеXML;
	Чтение.ОткрытьФайл(ПолныйПутьКФаилу);
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(Чтение);
	
	Vendors = ОбъектXDTO.Directories.Customer;
	
	Если ТипЗнч(ОбъектXDTO.Documents.CashRegister) = Тип("ОбъектXDTO") Тогда
		Invoices = Новый Массив;
		Invoices.Добавить(ОбъектXDTO.Documents.CashRegister);
	Иначе
		Invoices = ОбъектXDTO.Documents.CashRegister;
	КонецЕсли;
	
	Для Каждого Invoice Из Invoices Цикл
		
		Если ТипЗнч(Invoice.Line) = Тип("ОбъектXDTO") Тогда
			Lines = Новый Массив;
			Lines.Добавить(Invoice.Line);
		Иначе
			Lines = Invoice.Line;
		КонецЕсли;
		
		Если Лев(Invoice.No,3) = "POP" Тогда
			Продолжить;
		КонецЕсли;	
		
		
		Для Каждого СтрокаLine ИЗ Lines Цикл
			
			ИмяДокумент = ИмяДокументОплаты(СтрокаLine);
			Если Не ЗначениеЗаполнено(ИмяДокумент) Тогда
				Продолжить;
			КонецЕсли;
			
			Дата = РС_ОбщегоНазначения.ПереводВДату(Invoice.PostingDate);
			Если НачалоДня(Дата) <> НачалоДня(ТекущаяДата()) Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не (СтрокаLine.MeansofPaymentCode = "CASH" ИЛИ СтрокаLine.MeansofPaymentCode = "POS-BOG" ИЛИ
				СтрокаLine.MeansofPaymentCode = "POS-TBC") Тогда
				Продолжить;
			КонецЕсли;
			
			НовДокумент = Документы[ИмяДокумент].СоздатьДокумент();
			НовДокумент.Заполнить(Неопределено);
			НовДокумент.Дата  		= РС_ОбщегоНазначения.ПереводВДату(Invoice.PostingDate);
			НовДокумент.TL_DMSNo 	= Invoice.No;
			НовДокумент.Контрагент	= ПолучитьКонтрагент(Invoice, Vendors, СтруктураПараметров, "Cash");
			НовДокумент.Комментарий = "დაგენერირდა DMS-დან " + ТекущаяДата;
			ЗаполнитьСчетКассу(СтрокаLine, НовДокумент);
			
			Amount = СтрЗаменить(СтрокаLine.AmountLCY, ",", "");
			НовСтрока = НовДокумент.РасшифровкаПлатежа.Добавить();
			НовСтрока.Договор				= НовДокумент.Контрагент.ДоговорПоУмолчанию;
			НовСтрока.СуммаРасчетов			= Число(СтрЗаменить(Amount, ".", Р_Д_Ч));
			НовСтрока.СуммаПлатежа			= НовСтрока.СуммаРасчетов;
			НовСтрока.Курс					= 1;
			НовСтрока.Кратность				= 1;
			НовСтрока.СтавкаНДС				= НДС18;
			НовСтрока.СуммаНДС				= НовСтрока.СуммаРасчетов * 18/118;
			НовСтрока.ПризнакАванса         = Истина;
			
			НовДокумент.СуммаДокумента		= НовСтрока.СуммаПлатежа;

			Попытка
				НовДокумент.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				НовДокумент.Записать(РежимЗаписиДокумента.Запись);
			КонецПопытки;
		
		КонецЦикла;
		
	КонецЦикла;

	Чтение.Закрыть();
	
КонецПроцедуры



//ცნობარების მიღება
Функция ПолучитьКонтрагент(Invoice, Vendors, СтруктураПараметров, ИмяИнвоса)

	//შესყიდვა
	Если ИмяИнвоса = "Purch" Тогда
		Если ТипЗнч(Vendors) = Тип("СписокXDTO") Тогда
			Для Каждого СтрокаVendor ИЗ Vendors Цикл
				Если СтрокаVendor.No = Invoice.Pay_toVendorNo Тогда
					Наименование	= СтрокаVendor.Name;
					ИНН				= ?(ТипЗнч(СтрокаVendor.VATRegistrationNo) = Тип("Строка"), СтрокаVendor.VATRegistrationNo, "");
					Прервать;
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ТипЗнч(Vendors) = Тип("ОбъектXDTO") Тогда
			Наименование 	= Vendors.Name;
			ИНН 			= ?(ТипЗнч(Vendors.VATRegistrationNo) = Тип("Строка"), Vendors.VATRegistrationNo, "");
		КонецЕсли;
		
		НайденнаяСсылка 	= ?(ЗначениеЗаполнено(ИНН), Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", ИНН), "");
		Если ЗначениеЗаполнено(НайденнаяСсылка) Тогда
			Ссылка	= НайденнаяСсылка;
		Иначе
			НовКонтрагент 			= Справочники.Контрагенты.СоздатьЭлемент();
			НовКонтрагент.Заполнить(Неопределено);
			ЗаполнитьЗначенияСвойств(НовКонтрагент, СтруктураПараметров.СчетаРегл);
			НовКонтрагент.ИНН 				= ИНН;
			НовКонтрагент.Наименование 		= Наименование;
			НовКонтрагент.ВидКонтрагента 	= ?(Invoice.Pay_toVendorNoType = "Business", СтруктураПараметров.ЮридическоеЛицо, СтруктураПараметров.ФизическоеЛицо);
			НовКонтрагент.Поставщик = Истина;
			НовКонтрагент.Записать();
			
			Ссылка = НовКонтрагент.Ссылка;
		КонецЕсли;
	//გაყიდვა/თანხის მიღება
	Иначе
		Если ИмяИнвоса = "Sale" Тогда
			КонтрагентType 	= "Bill_toCustomerNoType";
			VendorNo		= "Bill_toCustomerNo";
		Иначе
			КонтрагентType  = "SourceNoType";
			VendorNo		= "SourceNo";//"Pay_toVendorNo";
		КонецЕсли;
		ИНН = ?(Invoice[КонтрагентType]			= "Business", Invoice.VATRegistrationNo, Invoice.IDNumber);
		ИНН = ?(ТипЗнч(ИНН) = Тип("ОбъектXDTO"), "", ИНН);
		НайденнаяСсылка 	= ?(ЗначениеЗаполнено(ИНН), Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", ИНН), "");
		Если ЗначениеЗаполнено(НайденнаяСсылка) Тогда
			Ссылка	= НайденнаяСсылка;
		Иначе
			НовКонтрагент 			= Справочники.Контрагенты.СоздатьЭлемент();
			НовКонтрагент.Заполнить(Неопределено);
			ЗаполнитьЗначенияСвойств(НовКонтрагент, СтруктураПараметров.СчетаРегл);
			НовКонтрагент.ИНН 				= ИНН;
			Если ТипЗнч(Vendors) = Тип("СписокXDTO") Тогда
				Для Каждого СтрокаVendor ИЗ Vendors Цикл
					Если СтрокаVendor.No = Invoice[VendorNo] Тогда
						НовКонтрагент.Наименование	= СтрокаVendor.Name;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			ИначеЕсли ТипЗнч(Vendors) = Тип("ОбъектXDTO") Тогда
				НовКонтрагент.Наименование 	= Vendors.Name;
			КонецЕсли;
			
			НовКонтрагент.ВидКонтрагента 	= ?(Invoice[КонтрагентType] = "Business", СтруктураПараметров.ЮридическоеЛицо, СтруктураПараметров.ФизическоеЛицо);
			НовКонтрагент.Покупатель = Истина;
			НовКонтрагент.Записать();
			
			Ссылка = НовКонтрагент.Ссылка;
		КонецЕсли;
	КонецЕсли;
		
	Возврат Ссылка;
	
КонецФункции

Функция ПолучитьНоменклатуру(СтрокаLine, СтруктураПараметров, Items)

	Если НЕ СтрокаLine.Type = "Item" И Сред(СтрокаLine.No, СтрДлина(СтрокаLine.No)-1, 2) = "99" Тогда
		СоответствияУслуг99 = РегистрыСведений.LT_СоответствияУслуг99.ПолучитьПоследнее(, Новый Структура("DescriptionOfInstruction", СтрокаLine.InstructionName_));
		Возврат СоответствияУслуг99.Номенклатура;
	Иначе
		НайденнаяСсылка 	= Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", СтрокаLine.No);
		Если ЗначениеЗаполнено(НайденнаяСсылка) Тогда
			Ссылка	= НайденнаяСсылка;
		Иначе
			СчетаЗатратНоменклатуры = СтруктураПараметров.СчетаЗатратНоменклатуры;
			
			Услуга = НЕ СтрокаLine.Type = "Item";
			
			НовНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
			НовНоменклатура.Заполнить(Неопределено);
			НовНоменклатура.СчетУчетаЗатрат 	= СчетаЗатратНоменклатуры.СчетУчетаЗатрат;
			НовНоменклатура.СчетУчетаЗатратРегл = СчетаЗатратНоменклатуры.СчетУчетаЗатратРегл;

			НовНоменклатура.Наименование 		= СтрокаLine.Description;
			НовНоменклатура.НаименованиеПолное 	= СтрокаLine.Description;
			НовНоменклатура.Артикул 			= СтрокаLine.No;
			НовНоменклатура.ТипНоменклатуры 	= ?(НЕ Услуга, СтруктураПараметров.Запас, СтруктураПараметров.Услуга);
			
			
			//ზომის ერთეული
			НайденнаяЕдиница = ПолучитьЕдиницуИзмерения(СтрокаLine);
			//ЗначениеНеНайденнойЕдиници = ?(Услуга, СтруктураПараметров.Час, СтруктураПараметров.Штука);//+++ Дмгг
			//НовНоменклатура.ЕдиницаИзмерения	= ?(ЗначениеЗаполнено(НайденнаяЕдиница), НайденнаяЕдиница, ЗначениеНеНайденнойЕдиници);//СтруктураПараметров.Штука);
			НовНоменклатура.ЕдиницаИзмерения	= ?(ЗначениеЗаполнено(НайденнаяЕдиница), НайденнаяЕдиница, СтруктураПараметров.Штука);

			//კატეგორია
			НайденнаяКатегория = ПолучитьКатегорию(СтрокаLine,Услуга,Items);
			НовНоменклатура.КатегорияНоменклатуры = ?(ЗначениеЗаполнено(НайденнаяКатегория), НайденнаяКатегория, СтруктураПараметров.БезКатегории);
			
			InstructionName_ = "";
			//საქმიანობის მიმართულება
			Если Услуга Тогда
				InstructionName_ = СтрокаLine.InstructionName_;
			КонецЕсли;
			
			НовНоменклатура.Родитель = ПолучитьКатегорияНоменклатуры(InstructionName_); 
			
			НайденнаяНаправление = ПолучитьНаправление(НовНоменклатура.КатегорияНоменклатуры,Услуга,InstructionName_);
			НовНоменклатура.НаправлениеДеятельности = ?(ЗначениеЗаполнено(НайденнаяНаправление), НайденнаяНаправление, СтруктураПараметров.ОсновноеНаправление);
			
			НовНоменклатура.Записать();
			Ссылка = НовНоменклатура.Ссылка;
		КонецЕсли;
	КонецЕсли;

	Возврат Ссылка;
	
КонецФункции

Функция ПолучитьКатегорияНоменклатуры(DescriptionOfInstruction)
	
	Запись = РегистрыСведений.LT_ГруппаЗапасов.ПолучитьПоследнее(, Новый Структура("DescriptionOfInstruction", DescriptionOfInstruction));
	
	Возврат Запись.Группа;
	
КонецФункции

Функция ПолучитьЕдиницуИзмерения(СтрокаLine)

	Если ТипЗнч(СтрокаLine.UnitOfMeasureCode) = Тип("Строка") Тогда
		Возврат Справочники.КлассификаторЕдиницИзмерения.НайтиПоРеквизиту("МеждународноеСокращение", СтрокаLine.UnitOfMeasureCode);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьКатегорию(СтрокаLine, Услуга = Ложь, Items)

	Если Услуга Тогда
		ЗаписьКатегории = РегистрыСведений.LT_КатегорияУслуги.ПолучитьПоследнее();
	Иначе
		InventoryPostingGroup = "";
		Если ТипЗнч(Items) = Тип("СписокXDTO") Тогда
			Для Каждого СтрокaItem ИЗ Items Цикл
				Если СтрокaItem.No = СтрокаLine.No Тогда
					InventoryPostingGroup = СтрокaItem.InventoryPostingGroup;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ТипЗнч(Items) = Тип("ОбъектXDTO") Тогда
			InventoryPostingGroup = Items.InventoryPostingGroup;
		КонецЕсли;
		
		Возврат ПолучитьКатегориюИэрархический(InventoryPostingGroup,СтрокаLine.MakeCode,СтрокаLine.UnitOfMeasureCode);		
		
	КонецЕсли;
	
	Возврат ЗаписьКатегории.Категория;
	
КонецФункции

Функция ПолучитьКатегориюИэрархический(InventoryPostingGroup,MakeCode,UnitOfMeasure)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	LT_КатегорииЗапасовСрезПоследних.Категория,
	               |	1 КАК Приоритет
	               |ПОМЕСТИТЬ ВТПриоритеты
	               |ИЗ
	               |	РегистрСведений.LT_КатегорииЗапасов.СрезПоследних(
	               |			,
	               |			MakeCode = &MakeCode
	               |				И UnitOfMeasure = &UnitOfMeasure
	               |				И InventoryPostingGroup = &InventoryPostingGroup) КАК LT_КатегорииЗапасовСрезПоследних
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |
	               |ВЫБРАТЬ
	               |	LT_КатегорииЗапасовСрезПоследних.Категория,
	               |	2
	               |ИЗ
	               |	РегистрСведений.LT_КатегорииЗапасов.СрезПоследних(
	               |			,
	               |			MakeCode = &MakeCode
	               |				И InventoryPostingGroup = &InventoryPostingGroup) КАК LT_КатегорииЗапасовСрезПоследних
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	LT_КатегорииЗапасовСрезПоследних.Категория,
	               |	3
	               |ИЗ
	               |	РегистрСведений.LT_КатегорииЗапасов.СрезПоследних(, InventoryPostingGroup = &InventoryPostingGroup) КАК LT_КатегорииЗапасовСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТПриоритеты.Категория,
	               |	ВТПриоритеты.Приоритет КАК Приоритет
	               |ИЗ
	               |	ВТПриоритеты КАК ВТПриоритеты
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Приоритет";
	
	Запрос.УстановитьПараметр("InventoryPostingGroup",InventoryPostingGroup);
	Запрос.УстановитьПараметр("MakeCode",MakeCode);
	Запрос.УстановитьПараметр("UnitOfMeasure",UnitOfMeasure);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Категория;
	Иначе
		Возврат "";
	КонецЕсли;	
	
КонецФункции	

Функция ПолучитьНаправление(КатегорияНоменклатуры, Услуга = Ложь,DescriptionOfInstruction)
	
	Если Услуга Тогда
		ЗаписьНаправление = РегистрыСведений.LT_НаправленияДеятельностиУслуг.ПолучитьПоследнее(, Новый Структура("DescriptionOfInstruction", DescriptionOfInstruction));
	Иначе
		ЗаписьНаправление = РегистрыСведений.LT_НаправленияДеятельностиЗапасов.ПолучитьПоследнее(, Новый Структура("КатегорияНоменклатуры", КатегорияНоменклатуры));
	КонецЕсли;
	
	Возврат ЗаписьНаправление.НаправлениеДеятельности;
	
КонецФункции

Функция ИмяДокументОплаты(СтрокаLine)
	
	ИмяДокумента = ?(СтрокаLine.MeansofPaymentCode = "CASH", "ПоступлениеВКассу", "ПоступлениеНаСчет");
	Ссылка = Документы[ИмяДокумента].НайтиПоРеквизиту("TL_DMSNo", СтрокаLine.DocumentNo);
	
	Возврат ?(ЗначениеЗаполнено(Ссылка), "", ИмяДокумента);
	
КонецФункции

Процедура ЗаполнитьСчетКассу(СтрокаLine, НовДокумент)
	
	ЗаписьНаправление = РегистрыСведений.LT_СоответствияБанковскихСчетовКассы.ПолучитьПоследнее(, Новый Структура("POS", СтрокаLine.MeansofPaymentCode));
	Если ЗначениеЗаполнено(ЗаписьНаправление.БанковскийСчетКасса) Тогда
		Если СтрокаLine.MeansofPaymentCode = "CASH" Тогда
			НовДокумент.Касса 			= ЗаписьНаправление.БанковскийСчетКасса;
		Иначе
			НовДокумент.БанковскийСчет	= ЗаписьНаправление.БанковскийСчетКасса;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если СтрокаLine.MeansofPaymentCode = "CASH" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Кассы.Ссылка КАК Касса
			|ИЗ
			|	Справочник.Кассы КАК Кассы
			|ГДЕ
			|	НЕ Кассы.ПометкаУдаления
			|	И Кассы.ВалютаПоУмолчанию = &Валюта";
		Запрос.УстановитьПараметр("Валюта", 		НовДокумент.ВалютаДенежныхСредств);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			НовДокумент.Касса = Выборка.Касса;
		КонецЕсли;
	ИначеЕсли СтрокаLine.MeansofPaymentCode = "POS-BOG" ИЛИ
			  СтрокаLine.MeansofPaymentCode = "POS-TBC" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	БанковскиеСчета.Ссылка КАК Счет
			|ИЗ
			|	Справочник.БанковскиеСчета КАК БанковскиеСчета
			|ГДЕ
			|	БанковскиеСчета.Банк.СВИФТБИК = &СВИФТБИК
			|	И БанковскиеСчета.Владелец = &Организация
			|	И БанковскиеСчета.ВалютаДенежныхСредств = &Валюта";
		Запрос.УстановитьПараметр("Валюта", 		НовДокумент.ВалютаДенежныхСредств);
		Запрос.УстановитьПараметр("Организация", 	НовДокумент.Организация);
		Запрос.УстановитьПараметр("СВИФТБИК", 		?(СтрокаLine.MeansofPaymentCode = "POS-BOG", "BAGAGE22", "TBCBGE22"));
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			НовДокумент.БанковскийСчет = Выборка.Счет;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
